SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32L0180/MM32L0180_Application/Device/MM32L0180/Include/reg_i2c.h
/**
  * @brief I2C_ISR Register Bit Definition
  */
#define  I2C_ISR_RX_UNDER_Pos                     (0)
#define  I2C_ISR_RX_UNDER_Msk                     (0x1U << I2C_ISR_RX_UNDER_Pos)                    /*!<Receive buffer over*/
#define  I2C_ISR_RX_UNDER                         I2C_ISR_RX_UNDER_Msk
#define  I2C_ISR_RX_OVER_Pos                      (1)
#define  I2C_ISR_RX_OVER_Msk                      (0x1U << I2C_ISR_RX_OVER_Pos)                     /*!<Receive buffer over*/
#define  I2C_ISR_RX_OVER                          I2C_ISR_RX_OVER_Msk
#define  I2C_ISR_RX_FULL_Pos                      (2)
#define  I2C_ISR_RX_FULL_Msk                      (0x1U << I2C_ISR_RX_FULL_Pos)                     /*!<Receive buffer full*/
#define  I2C_ISR_RX_FULL                          I2C_ISR_RX_FULL_Msk
#define  I2C_ISR_TX_OVER_Pos                      (3)
#define  I2C_ISR_TX_OVER_Msk                      (0x1U << I2C_ISR_TX_OVER_Pos)                     /*!<Transmit buffer over*/
#define  I2C_ISR_TX_OVER                          I2C_ISR_TX_OVER_Msk
#define  I2C_ISR_TX_EMPTY_Pos                     (4)
#define  I2C_ISR_TX_EMPTY_Msk                     (0x1U << I2C_ISR_TX_EMPTY_Pos)                    /*!<Transmit buffer empty*/
#define  I2C_ISR_TX_EMPTY                         I2C_ISR_TX_EMPTY_Msk
#define  I2C_ISR_RD_REQ_Pos                       (5)
#define  I2C_ISR_RD_REQ_Msk                       (0x1U << I2C_ISR_RD_REQ_Pos)                      /*!<Read request*/
#define  I2C_ISR_RD_REQ                           I2C_ISR_RD_REQ_Msk
#define  I2C_ISR_TX_ABRT_Pos                      (6)
#define  I2C_ISR_TX_ABRT_Msk                      (0x1U << I2C_ISR_TX_ABRT_Pos)                     /*!<Transmit abort*/
#define  I2C_ISR_TX_ABRT                          I2C_ISR_TX_ABRT_Msk
#define  I2C_ISR_RX_DONE_Pos                      (7)
#define  I2C_ISR_RX_DONE_Msk                      (0x1U << I2C_ISR_RX_DONE_Pos)                     /*!<Slave transmit done*/
#define  I2C_ISR_RX_DONE                          I2C_ISR_RX_DONE_Msk
#define  I2C_ISR_ACTIV_Pos                        (8)
#define  I2C_ISR_ACTIV_Msk                        (0x1U << I2C_ISR_ACTIV_Pos)                       /*!<This bit captures I2C module activity. Once this bit is set, it stays set unless*/
#define  I2C_ISR_ACTIV                            I2C_ISR_ACTIV_Msk
#define  I2C_ISR_STOP_Pos                         (9)
#define  I2C_ISR_STOP_Msk                         (0x1U << I2C_ISR_STOP_Pos)                        /*!<STOP condition detection*/
#define  I2C_ISR_STOP                             I2C_ISR_STOP_Msk
#define  I2C_ISR_START_Pos                        (10)
#define  I2C_ISR_START_Msk                        (0x1U << I2C_ISR_START_Pos)                       /*!<START condition detection*/
#define  I2C_ISR_START                            I2C_ISR_START_Msk
#define  I2C_ISR_GC_Pos                           (11)
#define  I2C_ISR_GC_Msk                           (0x1U << I2C_ISR_GC_Pos)                          /*!<General Call*/
#define  I2C_ISR_GC                               I2C_ISR_GC_Msk

/**
  * @brief I2C_IMR Register Bit Definition
  */
#define  I2C_IMR_RX_UNDER_Pos                     (0)
#define  I2C_IMR_RX_UNDER_Msk                     (0x1U << I2C_IMR_RX_UNDER_Pos)                    /*!<Receive buffer over*/
#define  I2C_IMR_RX_UNDER                         I2C_IMR_RX_UNDER_Msk
#define  I2C_IMR_RX_OVER_Pos                      (1)
#define  I2C_IMR_RX_OVER_Msk                      (0x1U << I2C_IMR_RX_OVER_Pos)                     /*!<Receive buffer over*/
#define  I2C_IMR_RX_OVER                          I2C_IMR_RX_OVER_Msk
#define  I2C_IMR_RX_FULL_Pos                      (2)
#define  I2C_IMR_RX_FULL_Msk                      (0x1U << I2C_IMR_RX_FULL_Pos)                     /*!<Receive buffer full*/
#define  I2C_IMR_RX_FULL                          I2C_IMR_RX_FULL_Msk
#define  I2C_IMR_TX_OVER_Pos                      (3)
#define  I2C_IMR_TX_OVER_Msk                      (0x1U << I2C_IMR_TX_OVER_Pos)                     /*!<Transmit buffer over*/
#define  I2C_IMR_TX_OVER                          I2C_IMR_TX_OVER_Msk
#define  I2C_IMR_TX_EMPTY_Pos                     (4)
#define  I2C_IMR_TX_EMPTY_Msk                     (0x1U << I2C_IMR_TX_EMPTY_Pos)                    /*!<Transmit buffer empty*/
#define  I2C_IMR_TX_EMPTY                         I2C_IMR_TX_EMPTY_Msk
#define  I2C_IMR_RD_REQ_Pos                       (5)
#define  I2C_IMR_RD_REQ_Msk                       (0x1U << I2C_IMR_RD_REQ_Pos)                      /*!<Read request*/
#define  I2C_IMR_RD_REQ                           I2C_IMR_RD_REQ_Msk
#define  I2C_IMR_TX_ABRT_Pos                      (6)
#define  I2C_IMR_TX_ABRT_Msk                      (0x1U << I2C_IMR_TX_ABRT_Pos)                     /*!<Transmit abort*/
#define  I2C_IMR_TX_ABRT                          I2C_IMR_TX_ABRT_Msk
#define  I2C_IMR_RX_DONE_Pos                      (7)
#define  I2C_IMR_RX_DONE_Msk                      (0x1U << I2C_IMR_RX_DONE_Pos)                     /*!<Slave transmit done*/
#define  I2C_IMR_RX_DONE                          I2C_IMR_RX_DONE_Msk
#define  I2C_IMR_ACTIV_Pos                        (8)
#define  I2C_IMR_ACTIV_Msk                        (0x1U << I2C_IMR_ACTIV_Pos)                       /*!<This bit captures I2C module activity. Once this bit is set, it stays set unless*/
#define  I2C_IMR_ACTIV                            I2C_IMR_ACTIV_Msk
#define  I2C_IMR_STOP_Pos                         (9)
#define  I2C_IMR_STOP_Msk                         (0x1U << I2C_IMR_STOP_Pos)                        /*!<STOP condition detection*/
#define  I2C_IMR_STOP                             I2C_IMR_STOP_Msk
#define  I2C_IMR_START_Pos                        (10)
#define  I2C_IMR_START_Msk                        (0x1U << I2C_IMR_START_Pos)                       /*!<START condition detection*/
#define  I2C_IMR_START                            I2C_IMR_START_Msk
#define  I2C_IMR_GC_Pos                           (11)
#define  I2C_IMR_GC_Msk                           (0x1U << I2C_IMR_GC_Pos)                          /*!<General Call*/
#define  I2C_IMR_GC                               I2C_IMR_GC_Msk

/**
  * @brief I2C_RAWISR Register Bit Definition
  */
#define  I2C_RAWISR_RX_UNDER_Pos                  (0)
#define  I2C_RAWISR_RX_UNDER_Msk                  (0x1U << I2C_RAWISR_RX_UNDER_Pos)                 /*!<Receive buffer over*/
#define  I2C_RAWISR_RX_UNDER                      I2C_RAWISR_RX_UNDER_Msk
#define  I2C_RAWISR_RX_OVER_Pos                   (1)
#define  I2C_RAWISR_RX_OVER_Msk                   (0x1U << I2C_RAWISR_RX_OVER_Pos)                  /*!<Receive buffer over*/
#define  I2C_RAWISR_RX_OVER                       I2C_RAWISR_RX_OVER_Msk
#define  I2C_RAWISR_RX_FULL_Pos                   (2)
#define  I2C_RAWISR_RX_FULL_Msk                   (0x1U << I2C_RAWISR_RX_FULL_Pos)                  /*!<Receive buffer full*/
#define  I2C_RAWISR_RX_FULL                       I2C_RAWISR_RX_FULL_Msk
#define  I2C_RAWISR_TX_OVER_Pos                   (3)
#define  I2C_RAWISR_TX_OVER_Msk                   (0x1U << I2C_RAWISR_TX_OVER_Pos)                  /*!<Transmit buffer over*/
#define  I2C_RAWISR_TX_OVER                       I2C_RAWISR_TX_OVER_Msk
#define  I2C_RAWISR_TX_EMPTY_Pos                  (4)
#define  I2C_RAWISR_TX_EMPTY_Msk                  (0x1U << I2C_RAWISR_TX_EMPTY_Pos)                 /*!<Transmit buffer empty*/
#define  I2C_RAWISR_TX_EMPTY                      I2C_RAWISR_TX_EMPTY_Msk
#define  I2C_RAWISR_RD_REQ_Pos                    (5)
#define  I2C_RAWISR_RD_REQ_Msk                    (0x1U << I2C_RAWISR_RD_REQ_Pos)                   /*!<Read request*/
#define  I2C_RAWISR_RD_REQ                        I2C_RAWISR_RD_REQ_Msk
#define  I2C_RAWISR_TX_ABRT_Pos                   (6)
#define  I2C_RAWISR_TX_ABRT_Msk                   (0x1U << I2C_RAWISR_TX_ABRT_Pos)                  /*!<Transmit abort*/
#define  I2C_RAWISR_TX_ABRT                       I2C_RAWISR_TX_ABRT_Msk
#define  I2C_RAWISR_RX_DONE_Pos                   (7)
#define  I2C_RAWISR_RX_DONE_Msk                   (0x1U << I2C_RAWISR_RX_DONE_Pos)                  /*!<Slave transmit done*/
#define  I2C_RAWISR_RX_DONE                       I2C_RAWISR_RX_DONE_Msk
#define  I2C_RAWISR_ACTIV_Pos                     (8)
#define  I2C_RAWISR_ACTIV_Msk                     (0x1U << I2C_RAWISR_ACTIV_Pos)                    /*!<This bit captures I2C module activity. Once this bit is set, it stays set unless*/
#define  I2C_RAWISR_ACTIV                         I2C_RAWISR_ACTIV_Msk
#define  I2C_RAWISR_STOP_Pos                      (9)
#define  I2C_RAWISR_STOP_Msk                      (0x1U << I2C_RAWISR_STOP_Pos)                     /*!<STOP condition detection*/
#define  I2C_RAWISR_STOP                          I2C_RAWISR_STOP_Msk
#define  I2C_RAWISR_START_Pos                     (10)
#define  I2C_RAWISR_START_Msk                     (0x1U << I2C_RAWISR_START_Pos)                    /*!<START condition detection*/
#define  I2C_RAWISR_START                         I2C_RAWISR_START_Msk
#define  I2C_RAWISR_GC_Pos                        (11)
#define  I2C_RAWISR_GC_Msk                        (0x1U << I2C_RAWISR_GC_Pos)                       /*!<General Call*/
#define  I2C_RAWISR_GC                            I2C_RAWISR_GC_Msk

/**
  * @brief I2C_RXTLR Register Bit Definition
  */
#define  I2C_RXTLR_TL_Pos                         (0)
#define  I2C_RXTLR_TL_Msk                         (0xFFU << I2C_RXTLR_TL_Pos)                       /*!<Receive FIFO threshold level*/
#define  I2C_RXTLR_TL                             I2C_RXTLR_TL_Msk
#define  I2C_RXTLR_TL_0                           (0x01U << I2C_RXTLR_TL_Pos) 
#define  I2C_RXTLR_TL_1                           (0x02U << I2C_RXTLR_TL_Pos) 
#define  I2C_RXTLR_TL_2                           (0x04U << I2C_RXTLR_TL_Pos) 
#define  I2C_RXTLR_TL_3                           (0x08U << I2C_RXTLR_TL_Pos) 
#define  I2C_RXTLR_TL_4                           (0x10U << I2C_RXTLR_TL_Pos) 
#define  I2C_RXTLR_TL_5                           (0x20U << I2C_RXTLR_TL_Pos) 
#define  I2C_RXTLR_TL_6                           (0x40U << I2C_RXTLR_TL_Pos) 
#define  I2C_RXTLR_TL_7                           (0x80U << I2C_RXTLR_TL_Pos) 

/**
  * @brief I2C_TXTLR Register Bit Definition
  */
#define  I2C_TXTLR_TL_Pos                         (0)
#define  I2C_TXTLR_TL_Msk                         (0xFFU << I2C_TXTLR_TL_Pos)                       /*!<Transmit FIFO threshold level*/
#define  I2C_TXTLR_TL                             I2C_TXTLR_TL_Msk
#define  I2C_TXTLR_TL_0                           (0x01U << I2C_TXTLR_TL_Pos) 
#define  I2C_TXTLR_TL_1                           (0x02U << I2C_TXTLR_TL_Pos) 
#define  I2C_TXTLR_TL_2                           (0x04U << I2C_TXTLR_TL_Pos) 
#define  I2C_TXTLR_TL_3                           (0x08U << I2C_TXTLR_TL_Pos) 
#define  I2C_TXTLR_TL_4                           (0x10U << I2C_TXTLR_TL_Pos) 
#define  I2C_TXTLR_TL_5                           (0x20U << I2C_TXTLR_TL_Pos) 
#define  I2C_TXTLR_TL_6                           (0x40U << I2C_TXTLR_TL_Pos) 
#define  I2C_TXTLR_TL_7                           (0x80U << I2C_TXTLR_TL_Pos) 

/**
  * @brief I2C_ICR Register Bit Definition
  */
#define  I2C_ICR_ICR_Pos                          (0)
#define  I2C_ICR_ICR_Msk                          (0x1U << I2C_ICR_ICR_Pos)                         /*!<Reading this register clears all combined and independent interrupts.*/
#define  I2C_ICR_ICR                              I2C_ICR_ICR_Msk

/**
  * @brief I2C_RX_UNDER Register Bit Definition
  */
#define  I2C_RX_UNDER_RX_UNDER_Pos                (0)
#define  I2C_RX_UNDER_RX_UNDER_Msk                (0x1U << I2C_RX_UNDER_RX_UNDER_Pos)               /*!<Reading this register clears the RX_UNDER interrupt (I2C_RAWISR[0]).*/
#define  I2C_RX_UNDER_RX_UNDER                    I2C_RX_UNDER_RX_UNDER_Msk

/**
  * @brief I2C_RX_OVER Register Bit Definition
  */
#define  I2C_RX_OVER_RX_OVER_Pos                  (0)
#define  I2C_RX_OVER_RX_OVER_Msk                  (0x1U << I2C_RX_OVER_RX_OVER_Pos)                 /*!<Reading this register clears the RX_OVER interrupt (I2C_RAWISR[1]).*/
#define  I2C_RX_OVER_RX_OVER                      I2C_RX_OVER_RX_OVER_Msk

/**
  * @brief I2C_TX_OVER Register Bit Definition
  */
#define  I2C_TX_OVER_TX_OVER_Pos                  (0)
#define  I2C_TX_OVER_TX_OVER_Msk                  (0x1U << I2C_TX_OVER_TX_OVER_Pos)                 /*!<Reading this register clears the TX_OVER interrupt (I2C_RAWISR[3]).*/
#define  I2C_TX_OVER_TX_OVER                      I2C_TX_OVER_TX_OVER_Msk

/**
  * @brief I2C_RD_REQ Register Bit Definition
  */
#define  I2C_RD_REQ_RD_REQ_Pos                    (0)
#define  I2C_RD_REQ_RD_REQ_Msk                    (0x1U << I2C_RD_REQ_RD_REQ_Pos)                   /*!<Reading this register clears the RD_REQ interrupt (I2C_RAWISR[5]).*/
#define  I2C_RD_REQ_RD_REQ                        I2C_RD_REQ_RD_REQ_Msk

/**
  * @brief I2C_TX_ABRT Register Bit Definition
  */
#define  I2C_TX_ABRT_TX_ABRT_Pos                  (0)
#define  I2C_TX_ABRT_TX_ABRT_Msk                  (0x1U << I2C_TX_ABRT_TX_ABRT_Pos)                 /*!<Reading this register clears the TX_ABRT interrupt (I2C_RAWISR[6]).*/
#define  I2C_TX_ABRT_TX_ABRT                      I2C_TX_ABRT_TX_ABRT_Msk

/**
  * @brief I2C_RX_DONE Register Bit Definition
  */
#define  I2C_RX_DONE_RX_DONE_Pos                  (0)
#define  I2C_RX_DONE_RX_DONE_Msk                  (0x1U << I2C_RX_DONE_RX_DONE_Pos)                 /*!<Reading this register clears the RX_DONE interrupt (I2C_RAWISR[7]).*/
#define  I2C_RX_DONE_RX_DONE                      I2C_RX_DONE_RX_DONE_Msk

/**
  * @brief I2C_ACTIV Register Bit Definition
  */
#define  I2C_ACTIV_ACTIV_Pos                      (0)
#define  I2C_ACTIV_ACTIV_Msk                      (0x1U << I2C_ACTIV_ACTIV_Pos)                     /*!<Reading this register clears the ACTIV interrupt (I2C_RAWISR[8]) if the I2C is not active anymore.*/
#define  I2C_ACTIV_ACTIV                          I2C_ACTIV_ACTIV_Msk

/**
  * @brief I2C_STOP Register Bit Definition
  */
#define  I2C_STOP_STOP_Pos                        (0)
#define  I2C_STOP_STOP_Msk                        (0x1U << I2C_STOP_STOP_Pos)                       /*!<Reading this register clears the STOP interrupt (I2C_RAWISR[9]).*/
#define  I2C_STOP_STOP                            I2C_STOP_STOP_Msk

/**
  * @brief I2C_START Register Bit Definition
  */
#define  I2C_START_START_Pos                      (0)
#define  I2C_START_START_Msk                      (0x1U << I2C_START_START_Pos)                     /*!<Reading this register clears the START interrupt (I2C_RAWISR[10]).*/
#define  I2C_START_START                          I2C_START_START_Msk

/**
  * @brief I2C_GC Register Bit Definition
  */
#define  I2C_GC_GC_Pos                            (0)
#define  I2C_GC_GC_Msk                            (0x1U << I2C_GC_GC_Pos)                           /*!<Reading this register clears the GC interrupt (I2C_RAWISR[11]).*/
#define  I2C_GC_GC                                I2C_GC_GC_Msk

/**
  * @brief I2C_ENR Register Bit Definition
  */
#define  I2C_ENR_ENABLE_Pos                       (0)
#define  I2C_ENR_ENABLE_Msk                       (0x1U << I2C_ENR_ENABLE_Pos)                      /*!<I2C module enable*/
#define  I2C_ENR_ENABLE                           I2C_ENR_ENABLE_Msk
#define  I2C_ENR_ABORT_Pos                        (1)
#define  I2C_ENR_ABORT_Msk                        (0x1U << I2C_ENR_ABORT_Pos)                       /*!<I2C transfer abort*/
#define  I2C_ENR_ABORT                            I2C_ENR_ABORT_Msk

/**
  * @brief I2C_SR Register Bit Definition
  */
#define  I2C_SR_ACTIV_Pos                         (0)
#define  I2C_SR_ACTIV_Msk                         (0x1U << I2C_SR_ACTIV_Pos)                        /*!<I2C activity status*/
#define  I2C_SR_ACTIV                             I2C_SR_ACTIV_Msk
#define  I2C_SR_TFNF_Pos                          (1)
#define  I2C_SR_TFNF_Msk                          (0x1U << I2C_SR_TFNF_Pos)                         /*!<Transmit FIFO not full*/
#define  I2C_SR_TFNF                              I2C_SR_TFNF_Msk
#define  I2C_SR_TFE_Pos                           (2)
#define  I2C_SR_TFE_Msk                           (0x1U << I2C_SR_TFE_Pos)                          /*!<Transmit FIFO completely empty*/
#define  I2C_SR_TFE                               I2C_SR_TFE_Msk
#define  I2C_SR_RFNE_Pos                          (3)
#define  I2C_SR_RFNE_Msk                          (0x1U << I2C_SR_RFNE_Pos)                         /*!<Receive FIFO not empty*/
#define  I2C_SR_RFNE                              I2C_SR_RFNE_Msk
#define  I2C_SR_RFF_Pos                           (4)
#define  I2C_SR_RFF_Msk                           (0x1U << I2C_SR_RFF_Pos)                          /*!<Receive FIFO completely full*/
#define  I2C_SR_RFF                               I2C_SR_RFF_Msk
#define  I2C_SR_MST_ACTIV_Pos                     (5)
#define  I2C_SR_MST_ACTIV_Msk                     (0x1U << I2C_SR_MST_ACTIV_Pos)                    /*!<Master FSM activity status*/
#define  I2C_SR_MST_ACTIV                         I2C_SR_MST_ACTIV_Msk
#define  I2C_SR_SLV_ACTIV_Pos                     (6)
#define  I2C_SR_SLV_ACTIV_Msk                     (0x1U << I2C_SR_SLV_ACTIV_Pos)                    /*!<Slave FSM activity status*/
#define  I2C_SR_SLV_ACTIV                         I2C_SR_SLV_ACTIV_Msk

/**
  * @brief I2C_TXFLR Register Bit Definition
  */
#define  I2C_TXFLR_CNT_Pos                        (0)
#define  I2C_TXFLR_CNT_Msk                        (0x3U << I2C_TXFLR_CNT_Pos)                       /*!<Contains the number of valid data entries in the transmit FIFO (0~2)*/
#define  I2C_TXFLR_CNT                            I2C_TXFLR_CNT_Msk
#define  I2C_TXFLR_CNT_0                          (0x1U << I2C_TXFLR_CNT_Pos) 
#define  I2C_TXFLR_CNT_1                          (0x2U << I2C_TXFLR_CNT_Pos) 

/**
  * @brief I2C_RXFLR Register Bit Definition
  */
#define  I2C_RXFLR_CNT_Pos                        (0)
#define  I2C_RXFLR_CNT_Msk                        (0x3U << I2C_RXFLR_CNT_Pos)                       /*!<Contains the number of valid data entries in the receive FIFO (0~2)*/
#define  I2C_RXFLR_CNT                            I2C_RXFLR_CNT_Msk
#define  I2C_RXFLR_CNT_0                          (0x1U << I2C_RXFLR_CNT_Pos) 
#define  I2C_RXFLR_CNT_1                          (0x2U << I2C_RXFLR_CNT_Pos) 

/**
  * @brief I2C_HOLD Register Bit Definition
  */
#define  I2C_HOLD_TX_HOLD_Pos                     (0)
#define  I2C_HOLD_TX_HOLD_Msk                     (0xFFFFU << I2C_HOLD_TX_HOLD_Pos)                 /*!<Sets the SDA hold time (after SCL goes from high to low ) in units of APB clock period, when I2C device acts as a transmitter.*/
#define  I2C_HOLD_TX_HOLD                         I2C_HOLD_TX_HOLD_Msk
#define  I2C_HOLD_TX_HOLD_0                       (0x0001U << I2C_HOLD_TX_HOLD_Pos) 
#define  I2C_HOLD_TX_HOLD_1                       (0x0002U << I2C_HOLD_TX_HOLD_Pos) 
#define  I2C_HOLD_TX_HOLD_2                       (0x0004U << I2C_HOLD_TX_HOLD_Pos) 
#define  I2C_HOLD_TX_HOLD_3                       (0x0008U << I2C_HOLD_TX_HOLD_Pos) 
#define  I2C_HOLD_TX_HOLD_4                       (0x0010U << I2C_HOLD_TX_HOLD_Pos) 
#define  I2C_HOLD_TX_HOLD_5                       (0x0020U << I2C_HOLD_TX_HOLD_Pos) 
#define  I2C_HOLD_TX_HOLD_6                       (0x0040U << I2C_HOLD_TX_HOLD_Pos) 
#define  I2C_HOLD_TX_HOLD_7                       (0x0080U << I2C_HOLD_TX_HOLD_Pos) 
#define  I2C_HOLD_TX_HOLD_8                       (0x0100U << I2C_HOLD_TX_HOLD_Pos) 
#define  I2C_HOLD_TX_HOLD_9                       (0x0200U << I2C_HOLD_TX_HOLD_Pos) 
#define  I2C_HOLD_TX_HOLD_10                      (0x0400U << I2C_HOLD_TX_HOLD_Pos) 
#define  I2C_HOLD_TX_HOLD_11                      (0x0800U << I2C_HOLD_TX_HOLD_Pos) 
#define  I2C_HOLD_TX_HOLD_12                      (0x1000U << I2C_HOLD_TX_HOLD_Pos) 
#define  I2C_HOLD_TX_HOLD_13                      (0x2000U << I2C_HOLD_TX_HOLD_Pos) 
#define  I2C_HOLD_TX_HOLD_14                      (0x4000U << I2C_HOLD_TX_HOLD_Pos) 
#define  I2C_HOLD_TX_HOLD_15                      (0x8000U << I2C_HOLD_TX_HOLD_Pos) 
#define  I2C_HOLD_RX_HOLD_Pos                     (16)
#define  I2C_HOLD_RX_HOLD_Msk                     (0xFFU << I2C_HOLD_RX_HOLD_Pos)                   /*!<Sets the internal SDA hold time (valid while SCL is high) in units of APB clock period, when I2C device acts as a receiver.*/
#define  I2C_HOLD_RX_HOLD                         I2C_HOLD_RX_HOLD_Msk
#define  I2C_HOLD_RX_HOLD_0                       (0x01U << I2C_HOLD_RX_HOLD_Pos) 
#define  I2C_HOLD_RX_HOLD_1                       (0x02U << I2C_HOLD_RX_HOLD_Pos) 
#define  I2C_HOLD_RX_HOLD_2                       (0x04U << I2C_HOLD_RX_HOLD_Pos) 
#define  I2C_HOLD_RX_HOLD_3                       (0x08U << I2C_HOLD_RX_HOLD_Pos) 
#define  I2C_HOLD_RX_HOLD_4                       (0x10U << I2C_HOLD_RX_HOLD_Pos) 
#define  I2C_HOLD_RX_HOLD_5                       (0x20U << I2C_HOLD_RX_HOLD_Pos) 
#define  I2C_HOLD_RX_HOLD_6                       (0x40U << I2C_HOLD_RX_HOLD_Pos) 
#define  I2C_HOLD_RX_HOLD_7                       (0x80U << I2C_HOLD_RX_HOLD_Pos) 

/**
  * @brief I2C_DMA Register Bit Definition
  */
#define  I2C_DMA_RXEN_Pos                         (0)
#define  I2C_DMA_RXEN_Msk                         (0x1U << I2C_DMA_RXEN_Pos)                        /*!<Receive DMA enable*/
#define  I2C_DMA_RXEN                             I2C_DMA_RXEN_Msk
#define  I2C_DMA_TXEN_Pos                         (1)
#define  I2C_DMA_TXEN_Msk                         (0x1U << I2C_DMA_TXEN_Pos)                        /*!<Transmit DMA enable*/
#define  I2C_DMA_TXEN                             I2C_DMA_TXEN_Msk

/**
  * @brief I2C_SETUP Register Bit Definition
  */
#define  I2C_SETUP_CNT_Pos                        (0)
#define  I2C_SETUP_CNT_Msk                        (0xFFU << I2C_SETUP_CNT_Pos)                      /*!<SDA setup time (min value is 2)*/
#define  I2C_SETUP_CNT                            I2C_SETUP_CNT_Msk
#define  I2C_SETUP_CNT_0                          (0x01U << I2C_SETUP_CNT_Pos) 
#define  I2C_SETUP_CNT_1                          (0x02U << I2C_SETUP_CNT_Pos) 
#define  I2C_SETUP_CNT_2                          (0x04U << I2C_SETUP_CNT_Pos) 
#define  I2C_SETUP_CNT_3                          (0x08U << I2C_SETUP_CNT_Pos) 
#define  I2C_SETUP_CNT_4                          (0x10U << I2C_SETUP_CNT_Pos) 
#define  I2C_SETUP_CNT_5                          (0x20U << I2C_SETUP_CNT_Pos) 
#define  I2C_SETUP_CNT_6                          (0x40U << I2C_SETUP_CNT_Pos) 
#define  I2C_SETUP_CNT_7                          (0x80U << I2C_SETUP_CNT_Pos) 

/**
  * @brief I2C_GCR Register Bit Definition
  */
#define  I2C_GCR_GC_Pos                           (0)
#define  I2C_GCR_GC_Msk                           (0x1U << I2C_GCR_GC_Pos)                          /*!<ACK General Call*/
#define  I2C_GCR_GC                               I2C_GCR_GC_Msk

